final/app/controllers/firstyears_controller.rb

SELECT "first_years".* FROM "first_years"
---
  def index
  	@firstyears = Firstyear.all

SELECT  "first_years".* FROM "first_years" WHERE "first_years"."id" = ? LIMIT 1  [["id", 1]]
SELECT "meetings".* FROM "meetings" WHERE "meetings"."firstyear_id" = ?  [["firstyear_id", 1]]
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @firstyear = Firstyear.find_by(id: params["id"])
    @meetings = Meeting.where(firstyear_id: @firstyear.id)
    @cases = []
    @meetings.each do |meeting|
    @cases << Case.find_by(id: meeting.firstyear_id)

INSERT INTO "firstyears" ("first_name", "last_name") VALUES (?, ?)  [["first_name", "Brian"], ["last_name", "Eng"]]
---
  def create
    firstyear_params = params.require(:firstyear).permit(:first_name, :last_name)
    Firstyear.create(firstyear_params)

SELECT  "firstyears".* FROM "firstyears" WHERE "firstyears"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @firstyear = Firstyear.find_by(id: params["id"])

SELECT  "firstyears".* FROM "firstyears" WHERE "firstyears"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "firstyears" SET "first_name" = ?, "last_name" = ? WHERE "firstyears"."id" = ?  [["first_name", "Joe"], ["last_name", "Long"], ["id", 1]]
---
  def update
    firstyear_params = params.require(:firstyear).permit(:first_name, :last_name)
    @firstyear = Firstyear.find_by(id: params["id"])
    @firstyear.update(firstyear_params)

SELECT  "firstyears".* FROM "firstyears" WHERE "firstyears"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "firstyears" WHERE "firstyears"."id" = ?  [["id", 6]]
---
  def destroy
    @firstyear = Firstyear.find_by(id: params["id"])
    @firstyear.destroy