final/app/views/meetings/new.html.erb

    <%= form.label :secondyear %>
    <%= form.collection_select :secondyear, SecondYear.all, :id, :first_name, {}, class: "form-control" %>
---
SELECT "second_years".* FROM "second_years"

    <%= form.label :case_id %>
    <%= form.collection_select :case_id, Case.all, :id, :title, {}, class: "form-control" %>
---
SELECT "cases".* FROM "cases"